Revit 2017 API
RebarConstraint.GetRebarConstraintTargetHostFaceType Method
 Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover.'
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public RebarConstraintTargetHostFaceType GetRebarConstraintTargetHostFaceType()
Visual Basic
Public Function GetRebarConstraintTargetHostFaceType As RebarConstraintTargetHostFaceType
Visual C++
public:
RebarConstraintTargetHostFaceType GetRebarConstraintTargetHostFaceType()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace